# taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "noti" # utility to display notifications from scripts
brew "trash" # rm, but put in the trash rather than completely delete

# Applications
cask "kitty" # a better terminal emulator
cask "imageoptim" # a tool to optimize images
cask "1password/tap/1password-cli"

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-cascadia-mono"

# communication
cask slack
cask zoom

# coding
cask firefox
cask google-chrome
cask visual-studio-code
cask google-chrome-canary
cask iterm2
cask docker
cask postman

# productivity
cask notion
cask todoist
cask 1password
cask setapp
cask dropbox
cask authy
cask alfred
cask rectangle
cask parallels
cask photosweeper-xr
cask anki
cask karabiner-elements

# investment
cask tradingview

tap "homebrew/bundle"
tap "homebrew/core"

# packages
brew "cloc" # lines of code counter
brew "git-delta" # a better git diff
brew "entr" # file watcher / command runner
brew "fd" # find alternative
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "gh" # GitHub CLI
brew "git" # Git version control (latest version)
brew "gnupg" # GPG
brew "grep" # grep (latest)
brew "highlight" # code syntax highlighting
brew "htop" # a top alternative
brew "jq" # work with JSON files in shell scripts
brew "neofetch" # pretty system info
brew "python" # python (latst)
brew "ripgrep" # very fast file searcher
brew "shellcheck" # diagnostics for shell sripts
brew "tmux" # terminal multiplexer
brew "tree" # pretty-print directory contents
brew "vim" # Vim (latest)
brew "wdiff" # word differences in text files
brew "wget" # internet file retriever
brew "z" # switch between most used directories
brew "zsh" # zsh (latest)
brew "asdf" # asdf
brew "yqrashawn/goku/goku" # goku for karabiner
